{"title": "How to re-discover the innovator within you", "talk_url": "aziph_mustapha_how_to_re_discover_the_innovator_within_you", "release_date": "1506710747", "duration": "0", "image_url": "aws.com/uploads/ced19010-d5f2-420a-9c68-af7eeefa7a33/maxresdefault.jpg", "tag": ["global issues"], "description": "Aziph has a unique mix of corporate, start up and government leadership experience. His last post was as CEO of the Malaysian Innovation Foundation, a national level federal agency in charge of developing innovation among all levels of society in Malaysia. He reported directly to the Federal Minister of Science, Technology and Innovation.\n\nAziph is an experienced international speaker, having presented keynotes, workshops and talks all around Malaysia and in Singapore, Indonesia, Thailand, Vietnam, Laos, Australia, Mozambique, South Africa, Belgium, Tajikistan, the UAE and Saudi Arabia.\n\nAziph is a regular face on Malaysian media, having been on all major TV networks as well as cable TV promoting various initiatives, or invited to give expert opinion on numerous topics. Needless to say, there are countless newspaper and magazine articles featuring him in the Malay, English and Chinese language newspapers and magazines.\n\nHe has been a Change Agent throughout his professional career (since 1992). He was an entrepreneur for 10 years, having started up and funded several companies. In 2005, he became an InTrepreneur... a salaried employee within a government agency charged with developing the national IT industry, but still pushing the limits as an entrepreneur would.\n\nAziph has recently started up a boutique consultancy specializing in Innovation, Creativity and Psychometric Testing Instruments. He has also been engaged by a state government to start up Malaysia's first week-long Festival of Ideas which will happen in September 2017.\n\nSpecialties: Grassroots Innovation, Strategic planning, Community Engagement, New Service roll-out, Innovation Management, Project Management, Online Collaboration, International Collaboration.", "author": "Aziph Mustapha", "keywords": "TED, talks, global issues", "talk_id": "2897", "lang": [], "download_link": "btitledDownloads\":null,\"audioDownload\":null},\"duration\":0,\"event\":\"TEDxUTP\",\"institute_partner_name\":null,\"salon_partner_name\":null,\"event_badge\":null,\"is_featured\":false,\"hero\":\"https://s3.amazonaws.com/talkstar", "views": "0"}