{"title": "How online games can change real life | Hans Shakur | TEDxJaffa", "talk_url": "hans_shakur_how_online_games_can_change_real_life", "release_date": "1507047258", "duration": "0", "image_url": "aws.com/uploads/f63e3bab-af66-442d-ab6c-7b98b640c218/maxresdefault.jpg", "tag": ["global issues"], "description": "Can online video games impact real life? What can we learn from young gamers? And how do we leverage online video games to make a difference in real life, effectively and efficiently? How can and how should mass popular online video games play a major role in counteracting mistrust and negative stereotypes between different people living in a conflict zone? Answers to these questions will be found in this fascinating lecture by Hans Shakur. \n\nYou can learn more about Hans’ work at his website: http://gamesforpeace.org\n\nHans Shakur is a pioneering entrepreneur, a tech veteran, and a leader in the Israeli high-tech scene, spearheading initiatives of economic development and fostering innovation in the Arab society in Israel. He headed the Arab Entrepreneurship Council and founded \"Mobile Monday Nazareth,\" the largest open tech-community platform in northern Israel. Hans is also the co-founder of '\"Games For Peace.\" Among his activities, Hans is serving as a director, advisor and lecturer at various start-up acceleration programs, and facilitating several tech-conferences and hackathons. He was recently chosen by Geektime as one of the Top 100 Influencers in Israeli high-tech.\n\nThis talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx", "author": "Hans Shakur", "keywords": "TED, talks, global issues", "talk_id": "2980", "lang": ["en", "ru", "fr", "tr", "es", "ar", "pt-BR", "uk"], "download_link": "btitledDownloads\":null,\"audioDownload\":null},\"duration\":0,\"event\":\"TEDxJaffa\",\"institute_partner_name\":null,\"salon_partner_name\":null,\"event_badge\":null,\"is_featured\":false,\"hero\":\"https://s3.amazonaws.com/talkstar", "views": "0"}