{"title": "Ratja Yaliyali (Vine Of love)", "talk_url": "gawurra_ratja_yaliyali_vine_of_love", "release_date": "1507050036", "duration": "0", "image_url": "aws.com/uploads/81e1bd52-2fdc-4603-b6b8-0e68593a11be/maxresdefault.jpg", "tag": ["entertainment"], "description": "Gawurra performs live at TEDxSydney 2017.\n\nStanley Gawurra Gaykamangu is a Yolngu performer hailing from Milingimbi (Yurrwi), North East Arnhem Land with a deeply resonant voice and musical sensitivity to match. Gawurra was born in Gove and raised on his grandmother’s land of Yathalamara, moving to Milingimbi (Yurrwi) when he was 12.\n\nGawurra won the NT Song of the Year in the Pop category in 2016 for the demo version of his song ‘Ratja Yaliyali’, which was the lead single on his debut album of the same name, released on 8 April through CAAMA Music. A beautiful melody, and a well-known Yolngu Songline, Ratja Yaliyali [pronounced Rart-ja yarl-i yarl-i] translates to Vine of Love; a thread of love that keeps everything connected. When Yolngu people hear it they feel the spirit in their hearts. If they have a problem or feel gloomy, they listen to Ratja Yaliyali as it touches them and builds their spirit making them stronger and brighter.\n\nGawurra is a gentle and genuine young leader. He is due to be an Elder in his community; the Old people gave him this knowledge and power. It is important for him to teach his kids, brothers, and sisters the ‘right way’. Gawurra sings in Gupapuyngu language of North East Arnhem Land and belongs to the Gaykamangu Buyalamarr clan.\n\nGawurra is not just telling an Indigenous story. He’s telling an Australian story.", "author": " Gawurra", "keywords": "TED, talks, entertainment", "talk_id": "2994", "lang": [], "download_link": "btitledDownloads\":null,\"audioDownload\":null},\"duration\":0,\"event\":\"TEDxSydney\",\"institute_partner_name\":null,\"salon_partner_name\":null,\"event_badge\":null,\"is_featured\":false,\"hero\":\"https://s3.amazonaws.com/talkstar", "views": "0"}